In [1]:
#Exp.no:5
# Aim : creation of data frame
#Name : Tanvi v mahatme
#Sec : A
#Roll no:35
#Sub : ET1
#Date :25-08-2025

In [2]:
import pandas as pd

In [4]:
df=pd.DataFrame([[15,12,14,16],[11,18,15,21],[17,13,14,15]],
               columns=["CD","DBMS","DSS","CAO"])

In [5]:
df

   CD  DBMS  DSS  CAO
0  15    12   14   16
1  11    18   15   21
2  17    13   14   15

In [6]:
df.shape

(3, 4)

In [7]:
df.size

12

In [9]:
df.ndim

2

In [10]:
df2=pd.DataFrame([[12,4,7,8]],
      columns=["CD","DBMS","DSS","CAO"])

In [30]:
df3=df.append(df2,ignore_index=True)

In [17]:
df2

   CD  DBMS  DSS  CAO
0  12     4    7    8

In [13]:
df3

   CD  DBMS  DSS  CAO
0  15    12   14   16
1  11    18   15   21
2  17    13   14   15
3  12     4    7    8

In [31]:
df3["DM"]=[12,13,14,15]

In [32]:
df3

   CD  DBMS  DSS  CAO  DM
0  15    12   14   16  12
1  11    18   15   21  13
2  17    13   14   15  14
3  12     4    7    8  15

In [35]:
df4=df3.drop(index=[0])

In [36]:
df4

   CD  DBMS  DSS  CAO  DM
1  11    18   15   21  13
2  17    13   14   15  14
3  12     4    7    8  15

In [37]:
df5=df3.drop(columns=["DM"])

In [41]:
df5

   CD  DBMS  DSS  CAO
0  15    12   14   16
1  11    18   15   21
2  17    13   14   15
3  12     4    7    8

In [42]:
print("Mean of DSS:",df5["DSS"].mean())

Mean of DSS: 12.5

In [43]:
print("Median of DSS:",df5["DSS"].median())

Median of DSS: 14.0

In [44]:
print("Mode of DSS:",df5["DSS"].mode())

Mode of DSS: 0    14
dtype: int64

In [45]:
print("Min of DSS:",df5["DSS"].min())

Min of DSS: 7

In [46]:
print("Max of DSS:",df5["DSS"].max())

Max of DSS: 15

In [51]:
Name =["Tanvi","Janvi","anvi","Kartiki"]

In [52]:
Name

['Tanvi', 'Janvi', 'anvi', 'Kartiki']

In [53]:
Roll_list=pd.Series(Name,index=[1,2,3,4])

In [54]:
print(Roll_list)

1      Tanvi
2      Janvi
3       anvi
4    Kartiki
dtype: object